interface demandsCard {
  id: string;
  title: string;
  description: string;
}

export const listOfDemands: demandsCard[] = [
  {
    id: 'П10',
    title:
      'Покупець на бізнеси в сфері обслуговування (ПР*, ДМ*, ВМ*, СК*, БЦ*).',
    description:
      'Сьогодні кожен може продати пральню, дизайнерську майстерню, цех з виробництва меблів, салон краси та б`юті центр за подвійною ціною.',
  },
  {
    id: 'П21',
    title: 'Покупець на 1-кімнатну квартиру (К-1).',
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за <b>50000</b>. \nКожен може продати 1-кімнатну квартиру за цією ціною',
  },
  {
    id: 'П11',
    title:
      'Покупець на бізнеси торгівлі та фінансів (ОВ*, ЛБ*, МП*, МО*, СМ*, ММ*, ІМ*)',
    description:
      'Власники торгової мережі скуповують пункт обміну валют, ломбард і всі магазини за півтори ціни \nКожен може продати своє підприємство за цією ціною',
  },
  {
    id: 'П1',
    title:
      'Покупець на бізнес в сфері транспортних послуг (ВИ*, АМ*, СТО*, ЛА*, ГР*)',
    description:
      'Іноземний інвестор викуповує великовантажні та легкові автомобілі, а також авто-майстерні та станції техобслуговування за подвійною ціною. \nЗа гараж пропонує <b>12000</b>\n Кожен може продати свої бізнеси',
  },
  {
    id: 'П24',
    title: 'Покупець на 2-кімнатну квартиру (К-2).',
    description:
      'Вам надійшла пропозиція продати 2-кімнатні квартири за <b>65000</b> \nКожен може продати 2-кімнатну квартиру за цією ціною',
  },
  {
    id: 'П-19',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 45 000. Оплата готівкою. Кожен може продати 1-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-22',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 52 000. Оплата готівкою. Кожен може продати 1-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-30',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    description:
      'Покупець пропонує по 110 000 за квартири, що здаються в оренду. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-3',
    title: 'Покупець на ПЗ, ІМ, 18, ЮФ',
    description:
      'Велика корпорація пропонує по 25 000 за фірму по розробці програмного забезпечення, інтернет-магазин, інтелектуальну власність, юридичну фірму. Кожен, хто володіє такими бізнесами, може їх продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-25',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    description:
      'Велика фірма скуповує 2-кімнатні квартири за 70 000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-29',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 100 000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-37',
    title: 'Покупець на офісні приміщення (ОФ, НЖ та ЮФ і РК)',
    description:
      'Велике підприємство купує за півтори ціни офісні приміщення і квартири, які переведені в нежитловий фонд. Також пропонує по 30 000 за юридичну фірму і фірму по ремонту квартир. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-2',
    title: 'Покупець на бізнеси у сфері торгівлі (МП, МО, СМ, ММ, ІМ)',
    description:
      'Власники торгівельної мережі скуповують усі магазини за подвійною ціною. Кожен може продати своє підприємство за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-8',
    title: 'Покупець на бізнес у сфері освіти (ПЛ, СШ, ТЦ)',
    description:
      'Власники приватного ліцею, спортивної школи і тренінгового центру можуть продати їх за подвійну ціну і отримати гроші у банкіра.',
  },
  {
    id: 'П-6',
    title: 'Покупець на ОЦ-12',
    description:
      'Вам пропонують за офісні центри 1 000 000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-27',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 80 000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-15',
    title: 'Покупець на земельні ділянки під забудову (1-5 га)',
    description:
      'Під приватне будівництво необхідно від 1 до 5 га землі. Покупець пропонує 20 000 за 1 гектар. Лише Ви можете продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-5',
    title: 'Покупець на бізнеси у сфері дозвілля (ТФ, ПК, РЦ, ФЗ, СІ)',
    description:
      'Вам пропонують за туристичну фірму, пейнтбольний комплекс, розважальний центр, фітнес-залу і прокат спортивного інвентарю подвійну ціну. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-34',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    description:
      'Вам пропонують по 55 000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-41',
    title: 'Покупець на малий і середній бізнес (ТФ, ВМ, ДМ, ПК, СШ)',
    description:
      'Тільки сьогодні можна продати дорожче в 2,5 рази туристичну фірму, цех із виробництва меблів, дизайнерську майстерню, пейнтбольний комплекс та спортивну школу. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П-31',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 115 000. Оплата готівкою. Тільки Ви можете скористатися цією пропозицією. Отримайте гроші у банкіра, якщо продаєте квартиру.',
  },
  {
    id: 'П-12',
    title: 'Покупець на бізнеси у сфері ремонту (РК, РТ, ПП, ГР)',
    description:
      'Підприємець пропонує за бізнеси по ремонту квартир і ремонту побутової техніки, гаражі та пункт побутових послуг по 18 000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-35',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    description:
      'Вам пропонують по 60 000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-6',
    title: 'Покупець на ОЦ-12',
    description:
      'Вам пропонують за офісні центри 900 000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-16',
    title: 'Покупець на бізнеси в сфері ремонту (РТ, РК, ПП)',
    description:
      'Сьогодні кожен може продати фірми з ремонту побутової техніки і ремонту квартир, а також пункт побутових послуг за подвійною ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-23',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    description:
      'Вам надійшла пропозиція продати 2-кімнатні квартири за 60 000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-44',
    title: 'Покупець на бізнеси в сфері послуг (ПР, СК, ДМ, БЦ, ФЗ, СІ)',
    description:
      'Сьогодні кожен може продати пральню, салон краси, дизайнерську майстерню, б`юті-центр, фітнес-залу і прокат спортивного інвентарю за півтори ціни і отримати гроші у банкіра.',
  },
  {
    id: 'П-42',
    title:
      'Покупець на бізнес у сфері громадського харчування (СБ, ІК, МК, РН)',
    description:
      'Корпорація заплатить подвійну ціну за суші-бар, інтернет-кафе, міні-кав`ярню і ресторан. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П-40',
    title: 'Покупець на малий бізнес (ЮФ, ЛА, ОВ, АП, МП)',
    description:
      'Лише сьогодні можна продати дорожче в 2,5 рази юридичну фірму, легковий автомобіль, пункт обміну валют, аптеку і магазин промтоварів. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П-17',
    title: 'Покупець на бізнеси в сфері охорони здоров`я (АП, ЛЦ, КС, КК)',
    description:
      'Велика компанія пропонує подвійну ціну за аптеки, лікувальний центр, клініку стоматології та клініку косметології. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-7',
    title: 'Покупець на бізнеси в сфері охорони здоров`я (АП, ЛЦ, КК, КС)',
    description:
      'Велика компанія викуповує аптеки, лікувальний центр, клініку косметології та клініку стоматології за півтори ціни. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-4',
    title: 'Покупець на ОЦ-12',
    description:
      'Вам пропонують за офісні центри 1 200 000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-39',
    title: 'Покупець на бізнес у сфері транспортних послуг (ВА, ЛА, АМ, СТО)',
    description:
      'Інвестор викуповує великовантажні і легкові автомобілі, а також авто-майстерні і станції техобслуговування за півтори ціни. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П-33',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    description:
      'Вам пропонують по 50 000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-26',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 90 000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-26',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    description:
      'Велика фірма скуповує 2-кімнатні квартири за 68 000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-32',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    description:
      'Вам пропонують по 45 000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-13',
    title:
      'Покупець на бізнес в сфері громадського харчування (СБ, ІК, МК, РН)',
    description:
      'Підприємець сьогодні готовий заплатити півтори ціни за суші-бар, інтернет-кафе, міні-кав`ярню і ресторан. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П-20',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 55 000. Оплата готівкою. Тільки Ви можете скористатися цією пропозицією. Отримайте гроші у банкіра, якщо продаєте квартиру.',
  },
  {
    id: 'П-43',
    title: 'Покупець на бізнес у сфері освіти і дозвілля (ТЦ, ПЛ, СШ, ПК, РЦ)',
    description:
      'Власники тренінгового центру, приватного ліцею, спортивної школи, пейнтбольного комплексу та розважального центру можуть продати їх за півтори ціни і отримати гроші у банкіра.',
  },
  {
    id: 'П-18',
    title: 'Покупець на бізнес в сфері фінансів (ОВ, ЛБ)',
    description:
      'Інвестор скуповує підприємства в сфері фінансів: пункти обміну валют і ломбарди за подвійною ціною. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
];
