export interface DemandsCard {
  id: string;
  title: string;
  codes: string[];
  description: string;
}

export const listOfDemands: DemandsCard[] = [
  {
    id: 'П10',
    title: 'Покупець на бізнеси в сфері обслуговування (ПР, ДМ, ВМ, СК, БЦ).',
    codes: ['ПР', 'ДМ', 'ВМ', 'СК', 'БЦ'],
    description:
      'Сьогодні кожен може продати пральню, дизайнерську майстерню, цех з виробництва меблів, салон краси та б`юті центр за подвійною ціною.',
  },
  {
    id: 'П21',
    title: 'Покупець на 1-кімнатну квартиру (К-1).',
    codes: ['К-1'],
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за <b>50000</b>. \nКожен може продати 1-кімнатну квартиру за цією ціною',
  },
  {
    id: 'П11',
    title:
      'Покупець на бізнеси торгівлі та фінансів (ОВ, ЛБ, МП, МО, СМ, ММ, ІМ)',
    codes: ['ОВ', 'ЛБ', 'МП', 'МО', 'СМ', 'ММ', 'ІМ'],
    description:
      'Власники торгової мережі скуповують пункт обміну валют, ломбард і всі магазини за півтори ціни \nКожен може продати своє підприємство за цією ціною',
  },
  {
    id: 'П1',
    title:
      'Покупець на бізнес в сфері транспортних послуг (ВИ, АМ, СТО, ЛА, ГР)',
    codes: ['ВИ', 'АМ', 'СТО', 'ЛА', 'ГР'],
    description:
      'Іноземний інвестор викуповує великовантажні та легкові автомобілі, а також авто-майстерні та станції техобслуговування за подвійною ціною. \nЗа гараж пропонує <b>12000</b>\n Кожен може продати свої бізнеси',
  },
  {
    id: 'П24',
    title: 'Покупець на 2-кімнатну квартиру (К-2).',
    codes: ['К-2'],
    description:
      'Вам надійшла пропозиція продати 2-кімнатні квартири за <b>65000</b> \nКожен може продати 2-кімнатну квартиру за цією ціною',
  },
  {
    id: 'П19',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    codes: ['К-1'],
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 45000. Оплата готівкою. Кожен може продати 1-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П22',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    codes: ['К-1'],
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 52000. Оплата готівкою. Кожен може продати 1-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П30',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    codes: ['К-3'],
    description:
      'Покупець пропонує по 110000 за квартири, що здаються в оренду. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П3',
    title: 'Покупець на ПЗ, ІМ, ІВ, ЮФ',
    codes: ['ПЗ', 'ІМ', 'ІВ', 'ЮФ'],
    description:
      'Велика корпорація пропонує по 25000 за фірму по розробці програмного забезпечення, інтернет-магазин, інтелектуальну власність, юридичну фірму. Кожен, хто володіє такими бізнесами, може їх продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П25',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    codes: ['К-2'],
    description:
      'Велика фірма скуповує 2-кімнатні квартири за 70000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П29',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    codes: ['К-3'],
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 100000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П37',
    title: 'Покупець на офісні приміщення (ОФ, НЖ та ЮФ і РК)',
    codes: ['ОФ', 'НЖ', 'ЮФ', 'РК'],
    description:
      'Велике підприємство купує за півтори ціни офісні приміщення і квартири, які переведені в нежитловий фонд. Також пропонує по 30000 за юридичну фірму і фірму по ремонту квартир. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П2',
    title: 'Покупець на бізнеси у сфері торгівлі (МП, МО, СМ, ММ, ІМ)',
    codes: ['МП', 'МО', 'СМ', 'ММ', 'ІМ'],
    description:
      'Власники торгівельної мережі скуповують усі магазини за подвійною ціною. Кожен може продати своє підприємство за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П8',
    title: 'Покупець на бізнес у сфері освіти (ПЛ, СШ, ТЦ)',
    codes: ['ПЛ', 'СШ', 'ТЦ'],
    description:
      'Власники приватного ліцею, спортивної школи і тренінгового центру можуть продати їх за подвійну ціну і отримати гроші у банкіра.',
  },
  {
    id: 'П5',
    title: 'Покупець на ОЦ-12',
    codes: ['ОЦ-12'],
    description:
      'Вам пропонують за офісні центри 900000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П6',
    title: 'Покупець на ОЦ-12',
    codes: ['ОЦ-12'],
    description:
      'Вам пропонують за офісні центри 1000000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П27',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    codes: ['К-3'],
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 80000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П28',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    codes: ['К-3'],
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 90000. Оплата готівкою. Кожен може продати 3-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П15',
    title: 'Покупець на земельні ділянки під забудову (1-5 га)',
    codes: ['1-5 га'],
    description:
      'Під приватне будівництво необхідно від 1 до 5 гектарів землі. Покупець пропонує 20000 за 1 гектар. Лише Ви можете продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П9',
    title: 'Покупець на бізнеси у сфері дозвілля (ТФ, ПК, РЦ, ФЗ, СІ)',
    codes: ['ТФ', 'ПК', 'РЦ', 'ФЗ', 'СІ'],
    description:
      'Вам пропонують за туристичну фірму, пейнтбольний комплекс, розважальний центр, фітнес-залу і прокат спортивного інвентарю подвійну ціну. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П14',
    title: 'Покупець на земельні ділянки під забудову (1-5ГА)',
    codes: ['1-5ГА'],
    description:
      'Під будівництво котеджів необхідно від одного до п`ятм гектарів землі, покупець пропонує по 10000 за кожен гектар. Кожен може продати за цією ціною',
  },
  {
    id: 'П36',
    title: 'Покупець на офісні приміщення (ОФ, НЖ)',
    codes: ['ОФ', 'НЖ'],
    description:
      'Велике підприємство пропонує за офісні приміщення і квартири, які переведені в нежитловий фонд 100000, 150000 та 200000 в залежності від кількості квартир. Кожен може продати за цією ціною',
  },
  {
    id: 'П38',
    title: 'Переведіть в нежитловий фонд (НЖ) К-1, К-2, К-3',
    codes: ['НЖ', 'К-1', 'К-2', 'К-3'],
    description:
      'Кожен може перевести свою квартиру в нежитловий фонд (НЖ) і збільшити в 2 рази її вартість та ПД. Для цього потрібно заплатити 4000, 8000 або 12000 в залежності від кількості кімнати у квартирі',
  },
  {
    id: 'П34',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    codes: ['Б-2', 'Б-4', 'Б-6'],
    description:
      'Вам пропонують по 55000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П41',
    title: 'Покупець на малий і середній бізнес (ТФ, ВМ, ДМ, ПК, СШ)',
    codes: ['ТФ', 'ВМ', 'ДМ', 'ПК', 'СШ'],
    description:
      'Тільки сьогодні можна продати дорожче в 2,5 рази туристичну фірму, цех із виробництва меблів, дизайнерську майстерню, пейнтбольний комплекс та спортивну школу. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П31',
    title: 'Покупець на 3-кімнатну квартиру (К-3)',
    codes: ['К-3'],
    description:
      'Вам надійшла пропозиція продати 3-кімнатні квартири за 115000. Оплата готівкою. Тільки Ви можете скористатися цією пропозицією. Отримайте гроші у банкіра, якщо продаєте квартиру.',
  },
  {
    id: 'П12',
    title: 'Покупець на бізнеси у сфері ремонту (РК, РТ, ПП, ГР)',
    codes: ['РК', 'РТ', 'ПП', 'ГР'],
    description:
      'Підприємець пропонує за бізнеси по ремонту квартир і ремонту побутової техніки, гаражі та пункт побутових послуг по 18000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П35',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    codes: ['Б-2', 'Б-4', 'Б-6'],
    description:
      'Вам пропонують по 60000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П16',
    title: 'Покупець на бізнеси в сфері ремонту (РТ, РК, ПП)',
    codes: ['РТ', 'РК', 'ПП'],
    description:
      'Сьогодні кожен може продати фірми з ремонту побутової техніки і ремонту квартир, а також пункт побутових послуг за подвійною ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П23',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    codes: ['К-2'],
    description:
      'Вам надійшла пропозиція продати 2-кімнатні квартири за 60000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П44',
    title: 'Покупець на бізнеси в сфері послуг (ПР, СК, ДМ, БЦ, ФЗ, СІ)',
    codes: ['ПР', 'СК', 'ДМ', 'БЦ', 'ФЗ', 'СІ'],
    description:
      'Сьогодні кожен може продати пральню, салон краси, дизайнерську майстерню, б`юті-центр, фітнес-залу і прокат спортивного інвентарю за півтори ціни і отримати гроші у банкіра.',
  },
  {
    id: 'П42',
    title:
      'Покупець на бізнес у сфері громадського харчування (СБ, ІК, МК, РН)',
    codes: ['СБ', 'ІК', 'МК', 'РН'],
    description:
      'Корпорація заплатить подвійну ціну за суші-бар, інтернет-кафе, міні-кав`ярню і ресторан. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П40',
    title: 'Покупець на малий бізнес (ЮФ, ЛА, ОВ, АП, МП)',
    codes: ['ЮФ', 'ЛА', 'ОВ', 'АП', 'МП'],
    description:
      'Лише сьогодні можна продати дорожче в 2,5 рази юридичну фірму, легковий автомобіль, пункт обміну валют, аптеку і магазин промтоварів. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П17',
    title: 'Покупець на бізнеси в сфері охорони здоров`я (АП, ЛЦ, КС, КК)',
    codes: ['АП', 'ЛЦ', 'КС', 'КК'],
    description:
      'Велика компанія пропонує подвійну ціну за аптеки, лікувальний центр, клініку стоматології та клініку косметології. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П7',
    title: 'Покупець на бізнеси в сфері охорони здоров`я (АП, ЛЦ, КК, КС)',
    codes: ['АП', 'ЛЦ', 'КК', 'КС'],
    description:
      'Велика компанія викуповує аптеки, лікувальний центр, клініку косметології та клініку стоматології за півтори ціни. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П4',
    title: 'Покупець на ОЦ-12',
    codes: ['ОЦ-12'],
    description:
      'Вам пропонують за офісні центри 1200000. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П39',
    title: 'Покупець на бізнес у сфері транспортних послуг (ВА, ЛА, АМ, СТО)',
    codes: ['ВА', 'ЛА', 'АМ', 'СТО'],
    description:
      'Інвестор викуповує великовантажні і легкові автомобілі, а також авто-майстерні і станції техобслуговування за півтори ціни. Кожен може продати свої бізнеси і отримати гроші у банкіра.',
  },
  {
    id: 'П33',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    codes: ['Б-2', 'Б-4', 'Б-6'],
    description:
      'Вам пропонують по 50000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П26',
    title: 'Покупець на 2-кімнатну квартиру (К-2)',
    codes: ['К-2'],
    description:
      'Велика фірма скуповує 2-кімнатні квартири за 68000. Оплата готівкою. Кожен може продати 2-кімнатну квартиру за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П32',
    title: 'Покупець на будинки Б-2, Б-4, Б-6',
    codes: ['Б-2', 'Б-4', 'Б-6'],
    description:
      'Вам пропонують по 45000 за кожну квартиру в будинках Б-2, Б-4, Б-6. Оплата готівкою. Кожен може продати нерухомість за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П13',
    title:
      'Покупець на бізнес в сфері громадського харчування (СБ, ІК, МК, РН)',
    codes: ['СБ', 'ІК', 'МК', 'РН'],
    description:
      'Підприємець сьогодні готовий заплатити півтори ціни за суші-бар, інтернет-кафе, міні-кав`ярню і ресторан. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
  {
    id: 'П20',
    title: 'Покупець на 1-кімнатну квартиру (К-1)',
    codes: ['К-1'],
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за 55000. Оплата готівкою. Тільки Ви можете скористатися цією пропозицією. Отримайте гроші у банкіра, якщо продаєте квартиру.',
  },
  {
    id: 'П43',
    title: 'Покупець на бізнес у сфері освіти і дозвілля (ТЦ, ПЛ, СШ, ПК, РЦ)',
    codes: ['ТЦ', 'ПЛ', 'СШ', 'ПК', 'РЦ'],
    description:
      'Власники тренінгового центру, приватного ліцею, спортивної школи, пейнтбольного комплексу та розважального центру можуть продати їх за півтори ціни і отримати гроші у банкіра.',
  },
  {
    id: 'П18',
    title: 'Покупець на бізнес в сфері фінансів (ОВ, ЛБ)',
    codes: ['ОВ', 'ЛБ'],
    description:
      'Інвестор скуповує підприємства в сфері фінансів: пункти обміну валют і ломбарди за подвійною ціною. Кожен може продати за цією ціною і отримати гроші у банкіра.',
  },
];
