interface demandsCard {
  id: string;
  title: string;
  description: string;
}

export const listOfDemands: demandsCard[] = [
  {
    id: 'П10',
    title:
      'Покупець на бізнеси в сфері обслуговування (ПР*, ДМ*, ВМ*, СК*, БЦ*).',
    description:
      'Сьогодні кожен може продати пральню, дизайнерську майстерню, цех з виробництва меблів, салон краси та б`юті центр за подвійною ціною.',
  },
  {
    id: 'П21',
    title: 'Покупець на 1-кімнатну квартиру (К-1).',
    description:
      'Вам надійшла пропозиція продати 1-кімнатні квартири за <b>50000</b>. \nКожен може продати 1-кімнатну квартиру за цією ціною',
  },
  {
    id: 'П11',
    title:
      'Покупець на бізнеси торгівлі та фінансів (ОВ*, ЛБ*, МП*, МО*, СМ*, ММ*, ІМ*)',
    description:
      'Власники торгової мережі скуповують пункт обміну валют, ломбард і всі магазини за півтори ціни \nКожен може продати своє підприємство за цією ціною',
  },
  {
    id: 'П1',
    title:
      'Покупець на бізнес в сфері транспортних послуг (ВИ*, АМ*, СТО*, ЛА*, ГР*)',
    description:
      'Іноземний інвестор викуповує великовантажні та легкові автомобілі, а також авто-майстерні та станції техобслуговування за подвійною ціною. \nЗа гараж пропонує <b>12000</b>\n Кожен може продати свої бізнеси',
  },
  {
    id: 'П24',
    title: 'Покупець на 2-кімнатну квартиру (К-2).',
    description:
      'Вам надійшла пропозиція продати 2-кімнатні квартири за <b>65000</b> \nКожен може продати 2-кімнатну квартиру за цією ціною',
  },
];
