interface eventsCard {
  id: string;
  title: string;
  description: string;
}

export const listOfEvents: eventsCard[] = [
  {
    id: 'ПД-9',
    title: 'Скорочення фонду оплати праці',
    description:
      'Усі гравці, що є найманими працівниками, зменшують свою заробітну плату на 20%.',
  },
  {
    id: 'ПД-5',
    title: 'Переваги навчання',
    description:
      'Усі гравці, що пройшли навчання або курси підвищення кваліфікації, отримують премію в розмірі 2000. Бізнес в сфері навчання (приватний ліцей (ПЛ+), спортивна школа (СШ), тренінговий центр (ТЦ-)) підвищують свій пасивний дохід (ПД) на 200.',
  },
  {
    id: 'ПД-10',
    title: 'Банківська криза',
    description:
      'Збільшення % ставок за кредитами. Оплата за користування кредитами на нерухомість збільшується на 100, на автомобіль на 50.',
  },
  {
    id: 'ПД-7',
    title: 'Оформіть спадок',
    description:
      'Усі гравці отримують спадщину в розмірі 10 ВК (вільних коштів), оплатіть податки та послуги адвоката 500.',
  },
  {
    id: 'ПД-12',
    title: 'Несподіваний інвестор',
    description: 'Кожен гравець може продати один бізнес за півтори ціни.',
  },
  {
    id: 'ПД-8',
    title: 'Діти - наше майбутнє',
    description:
      'Дітям необхідно дати гідну освіту. Гравці, що мають дітей, збільшують постійні витрати на дітей на 20%.',
  },
  {
    id: 'ПД-11',
    title: 'Підвищення фонду оплати праці',
    description:
      'Усі гравці, що є найманими працівниками, збільшують свою заробітну плату на 100.',
  },
  {
    id: 'ПД-3',
    title: 'Економічна криза',
    description:
      "У зв'язку зі зміною економічної ситуації в країні всі бізнеси із позначкою зменшують свій пасивний дохід (ПД) на 100.",
  },
  {
    id: 'ПД-1',
    title: 'Збитки від приватної власності, переданої в оренду',
    description:
      'Орендар не сплатив орендну плату за два місяці. Гравці, що мають передану в оренду нерухомість, сплачують 500.',
  },
  {
    id: 'ПД-4',
    title: 'Ваш малий і середній бізнес розширюються',
    description:
      'Урядом запроваджено пільги на розвиток малого і середнього бізнесу. Гравці, що мають бізнеси вартістю до 100 000, збільшують їх пасивний дохід (ПД) на 20%.',
  },
];
