interface eventsCard {
  id: string;
  title: string;
  description: string;
}

export const listOfEvents: eventsCard[] = [
  {
    id: 'ПД9',
    title: 'Скорочення фонду оплати праці.',
    description:
      'Усі гравці, що є найманими працівниками, зменшують свою заробітну плату на <b>20%</b>.',
  },
  {
    id: 'ПД10',
    title: 'Банківська криза.',
    description:
      'Збільшення % ставок за кредитами. Оплата за користування кредитами на нерухомість збільшується на <b>100</b>, на автомобіль - на <b>50</b>.',
  },
  {
    id: 'ПД12',
    title: 'Несподіваний інвестор.',
    description: 'Кожен гравець може продати один бізнес за півтори ціни.',
  },
  {
    id: 'ПД11',
    title: 'Підвищення фонду оплати праці.',
    description:
      'Усі гравці, що є найманими працівниками, збільшують свою заробітну плату на <b>100</b>.',
  },
  {
    id: 'ПД1',
    title: 'Збитки від приватної власності, переданої в оренду.',
    description:
      'Орендар не сплатив орендну плату за два місяці і зник. \nГравці, що мають передану в оренду нерухомість, сплачують <b>500</b>.',
  },
];
