const replic: string =
  '\nВикористайте цю можливість самостійно або запропонуйте її іншому гравцеві';

export interface BusinessLargeInvestment {
  type: 'business';
  id: string;
  code: string;
  cost: number;
  firstPayment: number;
  credit: number;
  passiveIncome: number;
  title: string;
  description: string;
  inputValue?: string;
}

export const listOfLargeInvestments: BusinessLargeInvestment[] = [
  {
    type: 'business',
    id: 'ВІ14',
    code: 'КС',
    cost: 180000,
    firstPayment: 30000,
    credit: 150000,
    passiveIncome: 1400,
    title: 'Клініка стоматології (КС*)',
    description:
      'Ви можете придбати сучасну клініку стоматології із великою клієнтською базою' +
      replic,
  },
  {
    type: 'business',
    id: 'ВІ36',
    code: 'Б-4',
    cost: 155000,
    firstPayment: 20000,
    credit: 135000,
    passiveIncome: 1000,
    title: 'Будинок на 4 сім`ї (Б-4)',
    description:
      'Виставлений на продаж будинок на 4 сім`ї в центрі міста' +
      replic +
      'Можлива ціна продажу в подальшому - до 240000',
  },
  {
    type: 'business',
    id: 'ВІ23',
    code: 'ОЦ-12',
    cost: 500000,
    firstPayment: 50000,
    credit: 450000,
    passiveIncome: 3500,
    title: 'Офісний центр (ОЦ-12)',
    description:
      'Виставлена на продаж дванадцяти-поверхова офісна будівля в центрі міста' +
      replic +
      'Можлива ціна продажу в подальшому - до 1200000',
  },
  {
    type: 'business',
    id: 'ВІ10',
    code: 'ПК',
    cost: 40000,
    firstPayment: 15000,
    credit: 25000,
    passiveIncome: 750,
    title: 'Пейнтбольний комплекс (ПК*)',
    description:
      'Продається пейнтбольний комплекс із високою дохідністю. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ25',
    code: 'К-3',
    cost: 65000,
    firstPayment: 8000,
    credit: 57000,
    passiveIncome: 450,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира в історичному центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100000.',
  },
  {
    type: 'business',
    id: 'ВІ26',
    code: 'К-3',
    cost: 70000,
    firstPayment: 9000,
    credit: 61000,
    passiveIncome: 500,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається чудова квартира в промисловому районі. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100000.',
  },
  {
    type: 'business',
    id: 'ВІ27',
    code: 'К-3',
    cost: 75000,
    firstPayment: 10000,
    credit: 65000,
    passiveIncome: -100,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається чудова квартира в новому районі неподалік від школи та дитячого садочка. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 115000.',
  },
  {
    type: 'business',
    id: 'ВІ28',
    code: 'К-3',
    cost: 80000,
    firstPayment: 12000,
    credit: 68000,
    passiveIncome: 600,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира в жилому стані на околиці Києва. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100000.',
  },
  {
    type: 'business',
    id: 'ВІ12',
    code: 'ІК',
    cost: 80000,
    firstPayment: 20000,
    credit: 60000,
    passiveIncome: 1000,
    title: 'Інтернет-кафе (ІК*)',
    description:
      'Власник інтернет-кафе продає свій бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ32',
    code: 'Б-2',
    cost: 70000,
    firstPayment: 10000,
    credit: 60000,
    passiveIncome: 720,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Власник вирішив змінити місце проживання і виставив будинок на продаж. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 110000.',
  },
  {
    type: 'business',
    id: 'ВІ33',
    code: 'Б-2',
    cost: 77000,
    firstPayment: 12000,
    credit: 65000,
    passiveIncome: 780,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'В елітному районі продається будинок. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 110000.',
  },
  {
    type: 'business',
    id: 'ВІ7',
    code: 'ДМ',
    cost: 40000,
    firstPayment: 20000,
    credit: 20000,
    passiveIncome: 950,
    title: 'Дизайнерська майстерня (ДМ*)',
    description:
      'Власник продає дизайнерську майстерню. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ8',
    code: 'СІ',
    cost: 35000,
    firstPayment: 35000,
    credit: 0,
    passiveIncome: 1000,
    title: 'Прокат спортивного інвентарю (СІ*)',
    description:
      'Ви можете придбати невеликий бізнес - прокат спортивного інвентарю біля зони відпочинку. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ17',
    code: 'ТЦ',
    cost: 120000,
    firstPayment: 40000,
    credit: 80000,
    passiveIncome: 1800,
    title: 'Тренінговий центр (ТЦ*)',
    description:
      'Ви можете інвестувати свої кошти в розширення тренінгового центру. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ6',
    code: 'СМ',
    cost: 220000,
    firstPayment: 45000,
    credit: 175000,
    passiveIncome: 2250,
    title: 'Супермаркет (СМ*)',
    description:
      'Вам пропонують відкрити великий супермаркет в новому мікрорайоні. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ18',
    code: 'ЛЦ',
    cost: 200000,
    firstPayment: 35000,
    credit: 165000,
    passiveIncome: 1600,
    title: 'Лікувальний центр (ЛЦ*)',
    description:
      'Ви можете придбати відмінно обладнаний лікувальний центр із великою клієнтською базою. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ19',
    code: 'КК',
    cost: 150000,
    firstPayment: 25000,
    credit: 125000,
    passiveIncome: 1250,
    title: 'Клініка косметологія (КК*)',
    description:
      'Виставлена на продаж клініка косметологія. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ15',
    code: 'БЦ',
    cost: 120000,
    firstPayment: 30000,
    credit: 90000,
    passiveIncome: 1300,
    title: 'Б`юті-центр (БЦ*)',
    description:
      'Власниця модного б`юті-центру змінює місце проживання і продає свій бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ38',
    code: 'Б-6',
    cost: 250000,
    credit: 220000,
    firstPayment: 30000,
    passiveIncome: 1600,
    title: 'Будинок на 6 сімей (Б-6)',
    description:
      'У приміській зоні продається будинок на 6 сімей. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 360000.',
  },
  {
    type: 'business',
    id: 'ВІ40',
    code: '20ГА',
    cost: 120000,
    credit: 60000,
    firstPayment: 60000,
    passiveIncome: 3000,
    title: '20 га землі сільськогосподарського призначення (20га)',
    description:
      'Продається земельна ділянка площею 20 га сільськогосподарського призначення, яка приносить високий дохід. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ24',
    code: '5ГА',
    cost: 15000,
    credit: 0,
    firstPayment: 15000,
    passiveIncome: -200,
    title: '5 га земельної ділянки під забудову (5га)',
    description:
      'В елітному районі продається земельна ділянка під забудову, надалі ціна має зрости в два-три рази. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ1',
    code: 'ПЛ',
    cost: 110000,
    credit: 90000,
    firstPayment: 20000,
    passiveIncome: 1000,
    title: 'Приватний ліцей (ПЛ*)',
    description:
      'Вам пропонують вкласти гроші у відкриття приватного ліцею для навчання дітей за надсучасними освітніми технологіями. Використайте цю можливість самі або запропонуйте іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ37',
    code: 'Б-4',
    cost: 180000,
    credit: 155000,
    firstPayment: 25000,
    passiveIncome: 1250,
    title: 'Будинок на 4 сім`ї (Б-4)',
    description:
      'В тихому мікрорайоні продається будинок на 4 сім`ї. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 240000.',
  },
  {
    type: 'business',
    id: 'ВІ11',
    code: 'РН',
    cost: 130000,
    credit: 100000,
    firstPayment: 30000,
    passiveIncome: 1400,
    title: 'Ресторан (РН*)',
    description:
      'В парковій зоні відпочинку продається ресторан. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ4',
    code: 'ВА',
    cost: 150000,
    credit: 105000,
    firstPayment: 45000,
    passiveIncome: 2500,
    title: 'Великовантажний автомобіль (ВА*)',
    description:
      'Продається великовантажний автомобіль з можливістю надавати його в оренду. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ9',
    code: 'СШ',
    cost: 35000,
    credit: 0,
    firstPayment: 35000,
    passiveIncome: 1400,
    title: 'Спортивна школа (СШ*)',
    description:
      'Вашому району необхідна спортивна школа. Вкладіть гроші в цей бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ31',
    code: 'Б-2',
    cost: 65000,
    credit: 57000,
    firstPayment: 8000,
    passiveIncome: 640,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Власнику будинку терміново необхідні гроші і він виставив його на продаж. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 110000.',
  },
  {
    type: 'business',
    id: 'ВІ34',
    code: 'Б-2',
    cost: 85000,
    credit: 70000,
    firstPayment: 15000,
    passiveIncome: 900,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Неподалік від зони відпочинку продається повністю готовий будинок. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 120000.',
  },
  {
    type: 'business',
    id: 'ВІ35',
    code: 'Б-4',
    cost: 140000,
    credit: 125000,
    firstPayment: 15000,
    passiveIncome: 850,
    title: 'Будинок на 4 сім`ї (Б-4)',
    description:
      'Терміново продається будинок на 4 сім`ї. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 220000.',
  },
  {
    type: 'business',
    id: 'ВІ3',
    code: 'СБ',
    cost: 70000,
    credit: 52000,
    firstPayment: 18000,
    passiveIncome: 900,
    title: 'Суші-бар (СБ*)',
    description:
      'Вам пропонують придбати популярний суші-бар в людному місці. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ29',
    code: 'К-3',
    cost: 100000,
    credit: 93000,
    firstPayment: 7000,
    passiveIncome: -50,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира із "будівельним" ремонтом в новому елітному будинку у центрі Львова. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 115000.',
  },
  {
    type: 'business',
    id: 'ВІ30',
    code: 'К-3',
    cost: 90000,
    credit: 70000,
    firstPayment: 20000,
    passiveIncome: 900,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира за кордоном. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 115000.',
  },
  {
    type: 'business',
    id: 'ВІ39',
    code: 'Б-6',
    cost: 280000,
    credit: 245000,
    firstPayment: 35000,
    passiveIncome: 1800,
    title: 'Будинок на 6 сімей (Б-6)',
    description:
      'Продається будинок на 6 сімей біля озера. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 360000.',
  },
  {
    type: 'business',
    id: 'ВІ16',
    code: 'РЦ',
    cost: 200000,
    credit: 140000,
    firstPayment: 60000,
    passiveIncome: 2800,
    title: 'Розважальний центр (РЦ*)',
    description:
      'Ви можете придбати новий розважальний центр для дітей та дорослих. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ20',
    code: 'ОФ',
    cost: 120000,
    credit: 100000,
    firstPayment: 20000,
    passiveIncome: 1400,
    title: 'Офісне приміщення (ОФ)',
    description:
      'В діловому кварталі виставлене на продаж 3-ри кімнатне офісне приміщення із надсучасним дизайном. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ13',
    code: 'ПР',
    cost: 120000,
    credit: 80000,
    firstPayment: 40000,
    passiveIncome: 1600,
    title: 'Пральня (ПР*)',
    description:
      'Виставлена на продаж сучасна пральня для здійснення чищення різноманітних виробів. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ5',
    code: 'АМ',
    cost: 250000,
    credit: 150000,
    firstPayment: 100000,
    passiveIncome: 4000,
    title: 'Авто-майстерня (АМ*)',
    description:
      'Продається авто-майстерня при в`їзді у місто. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ2',
    code: 'ЛБ',
    cost: 105000,
    credit: 75000,
    firstPayment: 30000,
    passiveIncome: 1350,
    title: 'Ломбард (ЛБ*)',
    description:
      'Ваш знайомий пропонує вам викупити у нього ломбард. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ22',
    code: 'ОЦ-12',
    cost: 650000,
    credit: 585000,
    firstPayment: 65000,
    passiveIncome: 5000,
    title: 'Офісний центр (ОЦ-12) ',
    description:
      'Виставлена на продаж 12-поверхова офісна будівля в центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 1200000',
  },
  {
    type: 'business',
    id: 'ВІ21',
    code: 'ОЦ-12',
    cost: 700000,
    credit: 620000,
    firstPayment: 80000,
    passiveIncome: 5600,
    title: 'Офісний центр (ОЦ-12) ',
    description:
      'Виставлена на продаж 12-поверхова офісна будівля в центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 1200000',
  },
];
