const replic: string =
  '\nВикористайте цю можливість самостійно або запропонуйте її іншому гравцеві';

interface businessLargeInvestment {
  type: 'business';
  id: string;
  cost: number;
  firstPayment: number;
  credit: number;
  passiveIncome: number;
  title: string;
  description: string;
}

export const listOfLargeInvestments: businessLargeInvestment[] = [
  {
    type: 'business',
    id: 'ВІ14',
    cost: 180000,
    firstPayment: 30000,
    credit: 150000,
    passiveIncome: 1400,
    title: 'Клініка стоматології (КС*)',
    description:
      'Ви можете придбати сучасну клініку стоматології із великою клієнтською базою' +
      replic,
  },
  {
    type: 'business',
    id: 'ВІ36',
    cost: 155000,
    firstPayment: 20000,
    credit: 135000,
    passiveIncome: 1000,
    title: 'Будинок на 4 сім`ї (Б-4)',
    description:
      'Виставлений на продаж будинок на 4 сім`ї в центрі міста' +
      replic +
      'Можлива ціна продажу в подальшому - до 240000',
  },
  {
    type: 'business',
    id: 'ВІ23',
    cost: 500000,
    firstPayment: 50000,
    credit: 45000,
    passiveIncome: 3500,
    title: 'Офісний центр (ОЦ-12)',
    description:
      'Виставлена на продаж дванадцяти-поверхова офісна будівля в центрі міста' +
      replic +
      'Можлива ціна продажу в подальшому - до 1200000',
  },
  {
    type: 'business',
    id: 'ВІ10',
    cost: 40000,
    firstPayment: 15000,
    credit: 25000,
    passiveIncome: 750,
    title: 'Пейнтбольний комплекс (ПК)',
    description:
      'Продається пейнтбольний комплекс із високою дохідністю. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ25',
    cost: 65000,
    firstPayment: 8000,
    credit: 57000,
    passiveIncome: 450,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира в історичному центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100 000.',
  },
  {
    type: 'business',
    id: 'ВІ12',
    cost: 80000,
    firstPayment: 20000,
    credit: 60000,
    passiveIncome: 1000,
    title: 'Інтернет-кафе (ІК)',
    description:
      'Власник інтернет-кафе продає свій бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ32',
    cost: 70000,
    firstPayment: 10000,
    credit: 60000,
    passiveIncome: 720,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Власник вирішив змінити місце проживання і виставив будинок на продаж. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 110 000.',
  },
  {
    type: 'business',
    id: 'ВІ20',
    cost: 90000,
    firstPayment: 20000,
    credit: 70000,
    passiveIncome: 900,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира за кордоном. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 115 000.',
  },
  {
    type: 'business',
    id: 'ВІ7',
    cost: 40000,
    firstPayment: 20000,
    credit: 20000,
    passiveIncome: 960,
    title: 'Дизайнерська майстерня (ДМ)',
    description:
      'Власник продає дизайнерську майстерню. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ8',
    cost: 35000,
    firstPayment: 35000,
    credit: 0,
    passiveIncome: 1000,
    title: 'Прокат спортивного інвентарю (СІ)',
    description:
      'Ви можете придбати невеликий бізнес - прокат спортивного інвентарю біля зони відпочинку. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ17',
    cost: 120000,
    firstPayment: 40000,
    credit: 80000,
    passiveIncome: 1800,
    title: 'Тренінговий центр (ТЦ)',
    description:
      'Ви можете інвестувати свої кошти в розширення тренінгового центру. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ6',
    cost: 220000,
    firstPayment: 45000,
    credit: 175000,
    passiveIncome: 2250,
    title: 'Супермаркет (СМ)',
    description:
      'Вам пропонують відкрити великий супермаркет в новому мікрорайоні. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ18',
    cost: 200000,
    firstPayment: 35000,
    credit: 165000,
    passiveIncome: 1600,
    title: 'Лікувальний центр (ЛЦ)',
    description:
      'Ви можете придбати відмінно обладнаний лікувальний центр із великою клієнтською базою. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ16',
    cost: 120000,
    firstPayment: 30000,
    credit: 90000,
    passiveIncome: 1300,
    title: 'Б`юті-центр (БЦ)',
    description:
      'Власниця модного б`юті-центру змінює місце проживання і продає свій бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'ВІ20',
    cost: 80000,
    firstPayment: 12000,
    credit: 68000,
    passiveIncome: 600,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира в жилому стані на околиці Києва. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100 000.',
  },
  {
    type: 'business',
    id: 'ВІ38',
    cost: 250000,
    credit: 220000,
    firstPayment: 30000,
    passiveIncome: 1600,
    title: 'Будинок на 6 сімей (Б-6)',
    description:
      'У приміській зоні продається будинок на 6 сімей. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 350 000.',
  },
  {
    type: 'business',
    id: 'BІ40',
    cost: 120000,
    credit: 60000,
    firstPayment: 60000,
    passiveIncome: 3000,
    title: '20 га землі сільськогосподарського призначення (20га)',
    description:
      'Продається земельна ділянка площею 20 га сільськогосподарського призначення, яка приносить високий дохід. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ1',
    cost: 110000,
    credit: 90000,
    firstPayment: 20000,
    passiveIncome: 1000,
    title: 'Приватний ліцей (ПЛ)',
    description:
      'Вам пропонують вкласти гроші у відкриття приватного ліцею для навчання дітей за надсучасними освітніми технологіями. Використайте цю можливість самі або запропонуйте іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ37',
    cost: 180000,
    credit: 155000,
    firstPayment: 25000,
    passiveIncome: 1250,
    title: 'Будинок на 4 сім`ї (Б-4)',
    description:
      'В тихому мікрорайоні продається будинок на 4 сім`ї. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 240 000.',
  },
  {
    type: 'business',
    id: 'BІ11',
    cost: 130000,
    credit: 100000,
    firstPayment: 30000,
    passiveIncome: 1400,
    title: 'Ресторан (РН)',
    description:
      'В парковій зоні відпочинку продається ресторан. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ4',
    cost: 150000,
    credit: 105000,
    firstPayment: 45000,
    passiveIncome: 2500,
    title: 'Великовантажний автомобіль (ВА)',
    description:
      'Продається великовантажний автомобіль з можливістю надавати його в оренду. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ9',
    cost: 35000,
    credit: 0,
    firstPayment: 35000,
    passiveIncome: 1400,
    title: 'Спортивна школа (СШ)',
    description:
      'Вашому району необхідна спортивна школа. Вкладіть гроші в цей бізнес. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ31',
    cost: 65000,
    credit: 57000,
    firstPayment: 8000,
    passiveIncome: 640,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Власнику будинку терміново необхідні гроші і він виставив його на продаж. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 110 000.',
  },
  {
    type: 'business',
    id: 'BІ34',
    cost: 85000,
    credit: 70000,
    firstPayment: 15000,
    passiveIncome: 900,
    title: 'Будинок на 2 сім`ї (Б-2)',
    description:
      'Неподалік від зони відпочинку продається повністю готовий будинок. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 120 000.',
  },
  {
    type: 'business',
    id: 'BІ3',
    cost: 70000,
    credit: 52000,
    firstPayment: 18000,
    passiveIncome: 900,
    title: 'Суші-бар (СБ)',
    description:
      'Вам пропонують придбати популярний суші-бар в людному місці. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ29',
    cost: 100000,
    credit: 93000,
    firstPayment: 7000,
    passiveIncome: -50,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира із "будівельним" ремонтом в новому елітному будинку у центрі Львова. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 115 000.',
  },
  {
    type: 'business',
    id: 'ВІ39',
    cost: 280000,
    credit: 245000,
    firstPayment: 35000,
    passiveIncome: 1800,
    title: 'Будинок на 6 сімей (Б-6)',
    description:
      'Продається будинок на 6 сімей біля озера. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 360 000.',
  },
  {
    type: 'business',
    id: 'BІ16',
    cost: 200000,
    credit: 140000,
    firstPayment: 60000,
    passiveIncome: 2800,
    title: 'Розважальний центр (РЦ)',
    description:
      'Ви можете придбати новий розважальний центр для дітей та дорослих. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ20',
    cost: 120000,
    credit: 100000,
    firstPayment: 20000,
    passiveIncome: 1400,
    title: 'Офісне приміщення (ОФ)',
    description:
      'В діловому кварталі виставлене на продаж 3-ри кімнатне офісне приміщення із надсучасним дизайном. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ13',
    cost: 120000,
    credit: 80000,
    firstPayment: 40000,
    passiveIncome: 1600,
    title: 'Пральня (ПР)',
    description:
      'Виставлена на продаж сучасна пральня для здійснення чищення різноманітних виробів. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ5',
    cost: 250000,
    credit: 150000,
    firstPayment: 100000,
    passiveIncome: 4000,
    title: 'Авто-майстерня (АМ)',
    description:
      'Продається авто-майстерня при в`їзді у місто. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ2',
    cost: 105000,
    credit: 75000,
    firstPayment: 35000,
    passiveIncome: 1350,
    title: 'Ломбард (ЛБ)',
    description:
      'Ваш знайомий пропонує вам викупити у нього ломбард. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'BІ22',
    cost: 70000,
    credit: 61000,
    firstPayment: 9000,
    passiveIncome: 500,
    title: 'Офісний центр (ОЦ-12) ',
    description:
      'Виставлена на продаж 12-поверхова офісна будівля в центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 1200000',
  },
];
