export interface BusinessInvestment {
  type: 'business';
  id: string;
  code: string;
  cost: number;
  firstPayment: number;
  credit: number;
  passiveIncome: number;
  title: string;
  description: string;
  inputValue?: string;
}

export interface CurrencyInvestment {
  type: 'currency';
  id: string;
  exchangeRate: string;
  priceRange: string;
  title: string;
  description: string;
  inputValue?: string;
}

export interface ShareInvestment {
  type: 'shares';
  id: string;
  currentlyPrice: number;
  priceRange: string;
  title: string;
  description: string;
  inputValue?: string;
}

export const listOfSmallInvestments: (
  | BusinessInvestment
  | CurrencyInvestment
  | ShareInvestment
)[] = [
  {
    type: 'shares',
    id: 'МІ30',
    currentlyPrice: 10,
    priceRange: '1-20',
    title: 'Акції "АгроСектор" (АС)',
    description:
      'Фінансове становище зміцнюється завдяки ефективним технологіям і розширення ринку збиту продукції, курсова вартість акцій підвищується до 10! Сьогодні кожен може придбати або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ17',
    code: 'ПЗ',
    cost: 6000,
    firstPayment: 6000,
    credit: 0,
    passiveIncome: 460,
    title: 'Програмне забезпечення (ПЗ)',
    description:
      'Відкрийте фірму із створення програмного забезпечення. \nВикористайте цю можливість самостійно або запропонуйте її іншому гравцеві',
  },
  {
    type: 'currency',
    id: 'МІ20',
    exchangeRate: '0.25',
    priceRange: '0.25-4',
    title: 'Курс євро (Є)',
    description:
      'Міжнародна політична ситуація вплинула на падіння цін на євро. Зараз кожен має можливість купити 1 євро за 0.25',
  },
  {
    type: 'business',
    id: 'МІ13',
    code: 'ОВ',
    cost: 9000,
    firstPayment: 1500,
    credit: 7500,
    passiveIncome: 120,
    title: 'Пункт обміну валюти (ОВ)',
    description:
      'Продається пункт обміну валюти. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'shares',
    id: 'МІ28',
    currentlyPrice: 1,
    priceRange: '1-20',
    title: 'Акції «АгроСектор» (АС)',
    description:
      'Конкуренція за ринок збуту призвела до різкого падіння цін на акції. Лише Ви можете купити або продати акції за цією ціною.',
  },
  {
    type: 'shares',
    id: 'МІ24',
    currentlyPrice: 2,
    priceRange: '2-30',
    title: 'Пайовий інвестиційний фонд (ПІФ)',
    description:
      'Економічні показники в країні погіршились, вартість паю зменшилась і становить лише 2. Лише Ви можете купити або продати акції за цією ціною.',
  },
  {
    type: 'shares',
    id: 'МІ25',
    currentlyPrice: 5,
    priceRange: '2-30',
    title: 'Пайовий інвестиційний фонд (ПІФ)',
    description:
      'У зв`язку з економічною ситуацією, сьогодні вартість паю становить 5. Кожен сьогодні може купити або продати ПІФ за цією ціною.',
  },
  {
    type: 'shares',
    id: 'МІ26',
    currentlyPrice: 15,
    priceRange: '2-30',
    title: 'Пайовий інвестиційний фонд (ПІФ)',
    description:
      'Пайовий інвестиційний фонд пропонує інвесторам придбати паї по 15. Кожен сьогодні може купити або продати ПІФ за цією ціною.',
  },
  {
    type: 'shares',
    id: 'МІ27',
    currentlyPrice: 30,
    priceRange: '2-30',
    title: 'Пайовий інвестиційний фонд (ПІФ)',
    description:
      'Менеджмент фонду за звітній період показав дуже гарний результат, прибудковість паю збільшилась. Кожен сьогодні може купити або продати ПІФ за цією ціною. Не змарнуйте свій шанс!',
  },
  {
    type: 'shares',
    id: 'МІ34',
    currentlyPrice: 20,
    priceRange: '2-40',
    title: 'Акції «ПромГрупа» (ПГ)',
    description:
      'Стабільність на ринку сприяє зростанню курсової вартості акції. Не змарнуйте свій шанс! Сьогодні кожен може купити або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ40',
    code: 'К-1',
    cost: 35000,
    firstPayment: 3300,
    credit: 31700,
    passiveIncome: 270,
    title: '1-кімнатна квартира (К-1)',
    description:
      'Сім`я продає свою квартиру та переїздить до нової. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 50 000.',
  },
  {
    type: 'business',
    id: 'МІ4',
    code: '1ГА',
    cost: 4000,
    firstPayment: 4000,
    credit: 0,
    passiveIncome: 0,
    title: '1ГА землі (1ГА)',
    description:
      'Родич пропонує вам викупити у нього земельну ділянку за собівартістю. Надалі прогнозується зростання цін на землю. Лише ви можете скористатися цією можливістю',
  },
  {
    type: 'business',
    id: 'МІ47',
    code: 'К-3',
    cost: 58000,
    firstPayment: 5800,
    credit: 52200,
    passiveIncome: 360,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Фірма продає квартиру в жилому стані. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100 000.',
  },
  {
    type: 'business',
    id: 'МІ48',
    code: 'К-3',
    cost: 88000,
    firstPayment: 6000,
    credit: 82000,
    passiveIncome: 500,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається чудова квартира в новому районі. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 100 000.',
  },
  {
    type: 'business',
    id: 'МІ16',
    code: 'АП',
    cost: 20000,
    firstPayment: 5000,
    credit: 15000,
    passiveIncome: 460,
    title: 'Аптека (АП)',
    description:
      'Ви маєте пропозицію придбати аптеку в спальному районі. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'shares',
    id: 'МІ35',
    currentlyPrice: 40,
    priceRange: '2-40',
    title: 'Акції «ПромГрупа» (ПГ)',
    description:
      'Стабільність на ринку та підвищений попит на продукцію призвели до зростання курсової вартості акцій. Сьогодні кожен може купити або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ42',
    code: 'К-2',
    cost: 42000,
    firstPayment: 4200,
    credit: 37800,
    passiveIncome: 320,
    title: '2-кімнатна квартира (К-2)',
    description:
      'У сусідньому будинку виставлена на продаж квартира. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 70 000.',
  },
  {
    type: 'shares',
    id: 'МІ29',
    currentlyPrice: 5,
    priceRange: '1-20',
    title: 'Акції «АгроСектор» (АС)',
    description:
      'Ціна на акції компанії в зв`язку з високою інфляцією стала різко падати. Сьогодні кожен може купити або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ46',
    code: 'К-3',
    cost: 65000,
    firstPayment: 0,
    credit: 65000,
    passiveIncome: -200,
    title: '3-кімнатна квартира (К-3)',
    description:
      'Продається квартира в старому фонді, потребує ремонту. Лише ви можете скористатися цією можливістю. Можлива ціна продажу в подальшому до 100 000.',
  },
  {
    type: 'business',
    id: 'МІ1',
    code: 'МО',
    cost: 24000,
    firstPayment: 3500,
    credit: 20500,
    passiveIncome: 200,
    title: 'Магазин одягу (МО*)',
    description:
      'Виставлений на продаж магазин брендового одягу в центрі міста. Використайте цю можливість самостійно, або запропонуйте її іншому гравцеві',
  },
  {
    type: 'business',
    id: 'МІ19',
    code: 'СК',
    cost: 18000,
    firstPayment: 4000,
    credit: 14000,
    passiveIncome: 280,
    title: 'Салон краси (СК)',
    description:
      'Продається салон краси з великою клієнтською базою. Використайте цю можливість самостійно, або запропонуйте її іншому гравцеві',
  },
  {
    type: 'business',
    id: 'МІ18',
    code: 'СТО',
    cost: 30000,
    firstPayment: 6000,
    credit: 24000,
    passiveIncome: 350,
    title: 'Станція технічного обслуговування (СТО)',
    description:
      'Ви маєте пропозицію створити станцію технічного обслуговування. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ49',
    code: 'ВМ',
    cost: 30000,
    firstPayment: 5000,
    credit: 25000,
    passiveIncome: 400,
    title: 'Виробництво меблів (ВМ)',
    description:
      'Вам пропонують відкрити цех з виробництва якісних меблів за індивідуальним замовленням. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ43',
    code: 'К-2',
    cost: 45000,
    firstPayment: 4500,
    credit: 40500,
    passiveIncome: 360,
    title: '2-кімнатна квартира (К-2)',
    description:
      'Продається квартира в новобудові .Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому - до 70000.',
  },
  {
    type: 'business',
    id: 'МІ10',
    code: 'ММ',
    cost: 50000,
    firstPayment: 6000,
    credit: 44000,
    passiveIncome: 460,
    title: 'Міні-маркет (ММ)',
    description:
      'Виставлений на продаж продуктовий міні-маркет на околиці міста. Використайте цю можливість самостійно або запропонуйте іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ6',
    code: 'МК',
    cost: 20000,
    firstPayment: 4000,
    credit: 16000,
    passiveIncome: 240,
    title: 'Міні-кав`ярня (МК)',
    description:
      'Відкрийте міні-кав`ярню в студентському містечку. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ37',
    code: 'К-1',
    cost: 27000,
    firstPayment: 3000,
    credit: 24000,
    passiveIncome: 200,
    title: '1-кімнатна квартира (К-1)',
    description:
      'Виставляється на продаж 1-кімнатна квартира. Тільки Ви можете скористатися цією пропозицією. Можлива ціна продажу в подальшому до 50 000.',
  },
  {
    type: 'business',
    id: 'МІ38',
    code: 'К-1',
    cost: 32000,
    firstPayment: 3000,
    credit: 29000,
    passiveIncome: 210,
    title: '1-кімнатна квартира (К-1)',
    description:
      'Власник вирішив жити за містом, виставляє на продаж свою однокімнатну квартиру. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 55 000.',
  },
  {
    type: 'business',
    id: 'МІ11',
    code: 'ІМ',
    cost: 9000,
    firstPayment: 3000,
    credit: 6000,
    passiveIncome: 300,
    title: 'Інтернет-магазин (ІМ)',
    description:
      'Створіть власний інтернет-магазин. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ36',
    code: 'К-1',
    cost: 20000,
    firstPayment: 2000,
    credit: 18000,
    passiveIncome: 120,
    title: '1-кімнатна квартира (К-1)',
    description:
      'Сім`я продає свою квартиру та переїздить до нової. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 55 000.',
  },
  {
    type: 'business',
    id: 'МІ45',
    code: 'К-2',
    cost: 46000,
    firstPayment: 4800,
    credit: 41200,
    passiveIncome: 380,
    title: '2-кімнатна квартира (К-2)',
    description:
      'Продається гарна квартира в новобудові. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 70 000.',
  },
  {
    type: 'business',
    id: 'МІ2',
    code: 'ГР',
    cost: 2000,
    firstPayment: 2000,
    credit: 0,
    passiveIncome: 160,
    title: 'Гараж (ГР)',
    description:
      'Вам пропонують купити гараж із 2 боксів для надання в оренду. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ5',
    code: 'MLM',
    cost: 400,
    firstPayment: 400,
    credit: 0,
    passiveIncome: 100,
    title: 'Створіть власний бізнес (MLM)',
    description:
      'Вашій родині пропонується підписати бізнес-контракт з компанією мережевого маркетингу для створення свого бізнесу.',
  },
  {
    type: 'business',
    id: 'МІ12',
    code: 'РТ',
    cost: 5000,
    credit: 3500,
    firstPayment: 1500,
    passiveIncome: 100,
    title: 'Ремонт побутової техніки (РТ)',
    description:
      'Придбайте майстерню з ремонту побутової техніки. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ41',
    code: 'К-2',
    cost: 38000,
    credit: 33000,
    firstPayment: 5000,
    passiveIncome: 400,
    title: '2-кімнатна квартира (К-2)',
    description:
      'Ваш знайомий переїздить до іншого міста і пропонує Вам свою квартиру за пільговою ціною. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 70 000.',
  },
  {
    type: 'business',
    id: 'МІ14',
    code: 'ПП',
    cost: 8000,
    credit: 5000,
    firstPayment: 3000,
    passiveIncome: 250,
    title: 'Пункт побутових послуг (ПП)',
    description:
      'Продається пункт побутових послуг в житловому кварталі. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ44',
    code: 'К-2',
    cost: 48000,
    credit: 43200,
    firstPayment: 4800,
    passiveIncome: 480,
    title: '2-кімнатна квартира (К-2)',
    description:
      'Продається гарна квартира в новобудові. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 70 000.',
  },
  {
    type: 'business',
    id: 'МІ7',
    code: 'МП',
    cost: 10000,
    credit: 6500,
    firstPayment: 3500,
    passiveIncome: 250,
    title: 'Магазин промтоварів (МП)',
    description:
      'Виставлений на продаж магазин промтоварів в центрі міста. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ8',
    code: 'ІВ',
    cost: 5000,
    credit: 0,
    firstPayment: 5000,
    passiveIncome: 400,
    title: 'Інтелектуальна власність (ІВ)',
    description:
      'Ви маєте можливість придбати патент на об`єкт інтелектуальної власності. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'currency',
    id: 'МІ21',
    exchangeRate: '0.5',
    priceRange: '0.25-4',
    title: 'Курс євро (€)',
    description:
      'Нестабільна фінансова ситуація в країні привела до зміни ціни на євро. Кожен може купити 1 євро за 0.5. Кожен може купити або продати за цією ціною',
  },
  {
    type: 'business',
    id: 'МІ15',
    code: 'ЛА',
    cost: 7000,
    credit: 4000,
    firstPayment: 3000,
    passiveIncome: 180,
    title: 'Легковий автомобіль (ЛА)',
    description:
      'Ви маєте пропозицію придбати легковий автомобіль для надання його в оренду службі таксі. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ52',
    code: 'ФЗ',
    cost: 25000,
    credit: 20000,
    firstPayment: 5000,
    passiveIncome: 380,
    title: 'Фітнес-зала (ФЗ)',
    description:
      'Відкрийте в своєму районі фітнес-зал для популяризації спорту і здорового способу життя. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ3',
    code: 'РК',
    cost: 6000,
    credit: 0,
    firstPayment: 6000,
    passiveIncome: 420,
    title: 'Ремонт квартир (РК)',
    description:
      'Вам пропонують відкрити підприємство по ремонту квартир і найняти робітників будівельних спеціальностей. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ9',
    code: '2ГА',
    cost: 12000,
    credit: 10000,
    firstPayment: 2000,
    passiveIncome: -50,
    title: '2ГА землі під забудову (2ГА)',
    description:
      'Виставлена на продаж земельна ділянка під забудову. Очікується будівництво супермаркету, ймовірна ціна ділянки зросте в 2-3 рази. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'business',
    id: 'МІ50',
    code: 'ТФ',
    cost: 30000,
    credit: 25000,
    firstPayment: 5000,
    passiveIncome: 480,
    title: 'Туристична фірма (ТФ)',
    description:
      'Відкрийте в своєму місті туристичну фірму. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.',
  },
  {
    type: 'shares',
    id: 'МІ33',
    currentlyPrice: 5,
    priceRange: '2-40',
    title: 'Акції «ПромГрупа» (ПГ)',
    description:
      'Ціна на акції компанії в зв`язку з високою інфляцією стала різко знижуватися. Сьогодні кожен може купити або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ51',
    code: 'ЮФ',
    cost: 6000,
    credit: 0,
    firstPayment: 6000,
    passiveIncome: 440,
    title: 'Юридична фірма (ЮФ)',
    description:
      "У вас з'явилася можливість створити власну юридичну фірму. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві.",
  },
  {
    type: 'currency',
    id: 'МІ22',
    exchangeRate: '1',
    priceRange: '0,25-4',
    title: 'Курс євро (€)',
    description:
      'Криза в країні вплинула на зростання ціни на євро. Кожен може отримати за 1 євро 1. Кожен може купити або продати за цією ціною',
  },
  {
    type: 'shares',
    id: 'МІ31',
    currentlyPrice: 20,
    priceRange: '1-20',
    title: 'Акції «АгроСектор» (АС)',
    description:
      'Компанія повідомляє про різке зростання цін на акції. Кожен можете купити або продати акції за цією ціною. Не змарнуйте свій шанс!',
  },
  {
    type: 'shares',
    id: 'МІ32',
    currentlyPrice: 2,
    priceRange: '2-40',
    title: 'Акції «ПромГрупа» (ПГ)',
    description:
      'Ситуація в промисловому секторі призвела до різкого зниження цін на акції. Тільки Ви можете купити або продати акції за цією ціною.',
  },
  {
    type: 'business',
    id: 'МІ39',
    code: 'К-1',
    cost: 40000,
    credit: 36000,
    firstPayment: 4000,
    passiveIncome: 320,
    title: '1-кімнатна квартира (К-1)',
    description:
      'Сім`я переїжджає в нову трикімнатну квартиру і продає свою 1-кімнатну квартиру з якісним сучасним ремонтом. Використайте цю можливість самостійно або запропонуйте її іншому гравцеві. Можлива ціна продажу в подальшому до 55 000.',
  },
  {
    type: 'currency',
    id: 'МІ23',
    exchangeRate: '4',
    priceRange: '0,25-4',
    title: 'Курс євро (€)',
    description:
      'Криза в країні вплинула на зростання ціни на євро. Кожен може отримати за 1 євро 4. Кожен може купити або продати за цією ціною. Не змарнуйте свій шанс',
  },
];
